Reference: <br>
https://www.digitalocean.com/community/tutorials/working-with-data-using-pandas-and-python-3

In [2]:
import numpy as np
import matplotlib.pyplot as pp
import pandas as pd
import seaborn
%matplotlib inline

In [4]:
import zipfile
zipfile.ZipFile('names.zip').extractall('.')

In [49]:
all_years = []

for year in range(1880, 2015+1):
    all_years.append(pd.read_csv('yob{}.txt'.format(year),
                                 names = ['Name', 'Sex', 'Babies']))
    all_years[-1]['Year'] = year

all_names = pd.concat(all_years)
all_names.tail()

         Name Sex  Babies  Year
33058  Zykell   M       5  2015
33059  Zyking   M       5  2015
33060   Zykir   M       5  2015
33061   Zyrus   M       5  2015
33062    Zyus   M       5  2015

In [50]:
group_name = all_names.groupby(['Sex', 'Year'])

In [52]:
group_name.size().unstack()

Year,1880,1881,1882,1883,1884,1885,1886,1887,1888,1889,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
Sex,,,,,,,,,,,,,,,,,,,,,
F,942,938,1028,1054,1172,1197,1282,1306,1474,1479,...,20047,20558,20454,20175,19810,19554,19486,19219,19169,19054
M,1058,997,1099,1030,1125,1097,1110,1067,1177,1111,...,14032,14388,14611,14522,14253,14339,14229,14034,14037,14009